TIM7040/week3/main.tex
% Created 2021-08-03 Tue 14:32
% Intended LaTeX compiler: pdflatex
\documentclass[unknownkeysallowed]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{pgfpages}
%%\setbeameroption{show notes on second screen=right}
%%\setbeamertemplate{note page}{\pagecolor{yellow!5}\insertnote}\usepackage{palatino}
\usetheme{Madrid}
\usecolortheme{beaver}
\usepackage{hyperref}
\usepackage{fontawesome}
\usepackage{csquotes}
\usepackage{hhline}
\usepackage{colortbl}
\usepackage{arydshln}
\usepackage{caption}
\usepackage[utf8]{inputenc}
\usepackage[gen]{eurosym}
\usepackage[style=apa,sortcites=true,sorting=nyt,backend=biber]{biblatex}
\DeclareLanguageMapping{american}{american-apa}
\addbibresource{/home/david/Dropbox/Org/References/bibliography.bib}
\title{Benefits and Importance of Policy Evaluation in the Enterprise}
\author{David A. Wagle}
\institute{Northcentral University \par \par TIM7040: Technology Policy and Strategy \par \par Dr. Dani Babb}
\date{August 1, 2021}
\title{Benefits and Importance of Policy Evaluation}
\usetheme{default}
\author{David Wagle}
\date{\today}
\title{Policy Evaluation in the Enterprise}
\hypersetup{
 pdfauthor={David Wagle},
 pdftitle={Policy Evaluation in the Enterprise},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode 9.5)}, 
 pdflang={English}}
\begin{document}

\maketitle


\begin{frame}[label={sec:org10b2811}]{Introduction}
\begin{itemize}
\item Governance is a requirement for modern businesses
\item Governance of Finance and Accounting is strongly tied to IT
\item This ties IT policy to corporate governance \parencite{holderMaterialWeaknessesInformation2016,liInternalExternalInfluences2007}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orga3909b4}]{Tool Components and Main Benefits}
\begin{columns}
\begin{column}{0.45\columnwidth}
\begin{block}{Components}
\begin{enumerate}
\item Validate regular updates
\item Validate stakeholders
\item Validate coherence
\item Coheres with legal and other
\item Defines ownership
\item Defines purpose and scope
\item Defines repercussions
\item Defines measurement \& metrics
\end{enumerate}
\end{block}
\end{column}

\begin{column}{0.45\columnwidth}
\begin{block}{Benefits}
\begin{enumerate}
\item Ensure technical relevance
\item Ensure business relevance
\item Ensure strategic purpose
\item Ensure for regulatory compliance
\item Ensure accountability
\item Ensure coverage
\item Clear onus of action
\item Clear demarcation of compliance
\end{enumerate}
\end{block}
\end{column}
\end{columns}
\end{frame}



\begin{frame}[label={sec:org27f2fed}]{Strengths and Weaknesses of the Tool}
\begin{columns}
\begin{column}{0.45\columnwidth}
\begin{block}{Strengths}
\begin{itemize}
\item Short and Simple
\item Broadly Applicable to all Policies
\item Not overly specific or positivist \parencite{spanacheImplicationsEUEvaluation2018}
\end{itemize}
\end{block}
\end{column}

\begin{column}{0.45\columnwidth}
\begin{block}{(Potential) Weaknesses}
\begin{itemize}
\item Not tied to any specific model(s) (e.g. CMMI \parencite{caralliMaturityModels1012012}
\item Not tied to any framework (ITIL / COBIT)
\item Lacks specific measurement advice for scoring boundaries
\end{itemize}
\end{block}
\end{column}
\end{columns}
\end{frame}


\begin{frame}[label={sec:org84e23ec}]{Potential Improvements to the Tool}
\begin{itemize}
\item<1-> Add particularized boundary scores
\item<2-> Conduct audited checks against ITIL/COBIT audits to validate
\item<3-> Adjust as necessary
\end{itemize}
\end{frame}


\begin{frame}[label={sec:orgf4762bb}]{Evaluation of the Tool}
\begin{itemize}
\item Adjusted tool includes descriptive scoring range
\item Scores based on ITIL/COBIT audit results of Accenture and 3 internal clients
\item Scale is pseudo-logrithmic, as ``3'' or better should be the norm for each question
\end{itemize}
\end{frame}


\begin{frame}[label={sec:org714536d}]{Policy Evaluation and Outcomes}
\begin{itemize}
\item<1-> total score of 60 - Mature Process
\item<2-> Track improvement efforts (efficiency and efficacy)
\item<3-> Part of strategic plan and continuous improvement effort
\item<4-> Consideration of on-going business activities
\end{itemize}
\end{frame}


\begin{frame}[label={sec:org40a5eaa}]{Potential New Policy Targets}
\begin{itemize}
\item All emerging IT strategies must consider if new policies are needed, examples include:
\begin{itemize}
\item Social Media \parencite{ashishkumarrathorePolicymakersUseSocial2021}
\item Big Data \parencite{mainaRevisitingNationalEHealth2019}
\item Cloud Computing \parencite{wangResearchDataSecurity2021}
\end{itemize}
\item Growing business considerations that rise to strategic importance
\begin{itemize}
\item Sustainable practices \parencite{choiSustainablePoliciesStrategies2016}
\item Privacy \parencite{bennettRevisitingGovernancePrivacy2020}
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org39ffd28}]{Strategic Value of IT Policy and Evaluation Tool Alignment}
\begin{itemize}
\item Policy and IT strategy matter for value creation
\item Policy and IT strategy matter for sustainability \parencite{chanChiefInformationOfficers2021}
\item Strategy and policy of new technologies incorporate organically cohere formally segmented areas
\begin{itemize}
\item Cloud resiliency for DR/BCP \parencite{jasgurLeveragingDisasterRecovery2019}
\item Big Data for Business Intelligence \parencite{zhangApplicationEmergingInformation2020}
\item Etc.
\end{itemize}
\end{itemize}




\appendix
\end{frame}



\begin{frame}[label={sec:org2cee68d}]{Appendix A - Scoring:}
\scriptsize
\begin{itemize}
\item \textbf{13 - 40}: Immature process. The business should focus on ensuring clear ownership and accountability for future improvements for this process. The business owners should place this process on a watch list for quarterly remediation and audit. Owners should be held accountable for developing a clear plan for incremental improvements and should be held accountable for meeting specific goals related to said improvement targets.

\item \textbf{40 - 55}: Developing process: The processes has some areas of acceptable quality and performance but is overall still not fully mature. The business should develop a plan for ensuring continued improvement. Process ownership should be defined and the process owners should be required to develop a one-year plan for incremental process improvement, and held accountable for meeting specific goals related to said improvement targets.

\item \textbf{55 - 60}: Mature process: The process has few if any areas where coverage is lacking. Focus should be on improving efficiency and efficacy of the process components that are in place. Process ownership should be defined and held accountable for tracking improvement efforts. There is no need to have a specific plan or targeted improvement goals at this level. However, the policy should still be part of organizational unit strategic plans and continuous improvement of the policy should be a consideration of on-going business activity.

\item \textbf{60 - 65}: Fully Mature Process: This process has little room for improvement. Focus at this level is on continuous improvement of efficiency and efficacy. Business owners and stakeholders should be focused on ensuring the process is continually updated to reflect changing strategic goals. Business owners and stakeholders should consider using this process as a model for ``lessons learned'' to inform less well-performing processes on how they might improve over time.
\end{itemize}
\end{frame}

\begin{frame}[allowframebreaks,label=]{Appendix B - Matrix Tool}
\scriptsize
\begin{longtable}{llllrr}
Item & Never/No & Infrequent & NA & Sometimes & Always/Yes\\
\hline
\endfirsthead
\multicolumn{6}{l}{Continued from previous page} \\
\hline

Item & Never/No & Infrequent & NA & Sometimes & Always/Yes \\

\hline
\endhead
\hline\multicolumn{6}{r}{Continued on next page} \\
\endfoot
\endlastfoot
\hline
Does the policy have a &  &  &  &  & 5\\
defined owner? &  &  &  &  & \\
\hline
Are the policy &  &  &  &  & 5\\
stakeholders defined? &  &  &  &  & \\
\hline
Is the policy purpose &  &  &  &  & 5\\
defined? &  &  &  &  & \\
\hline
Does the policy have &  &  &  &  & \\
any defined exceptions &  &  &  &  & 5\\
or exclusions? &  &  &  &  & \\
\hline
Does the policy have &  &  &  &  & \\
defined repercussion &  &  &  &  & \\
for failure to comply &  &  &  & 4 & \\
with each requirement? &  &  &  &  & \\
\hline
Does the policy define &  &  &  &  & \\
who is responsible &  &  &  & 4 & \\
for enforcement of each &  &  &  &  & \\
element? &  &  &  &  & \\
\hline
Is the policy scope &  &  &  &  & \\
clear? &  &  &  &  & 5\\
\hline
Does the policy link &  &  &  &  & \\
to appropriate &  &  &  &  & \\
supporting documents &  &  &  & 4 & \\
for each requirement? &  &  &  &  & \\
\hline
Does the policy define &  &  &  &  & \\
how compliance will be &  &  &  &  & \\
monitored for each &  &  &  & 4 & \\
requirement? &  &  &  &  & \\
\hline
Is the policy regularly &  &  &  &  & \\
updated as technology &  &  &  &  & 5\\
or environments change? &  &  &  &  & \\
\hline
Is the policy readily &  &  &  &  & \\
available to those to &  &  &  & 4 & \\
whom it applies? &  &  &  &  & \\
\hline
Is the policy overall &  &  &  &  & \\
coherent and fit &  &  &  &  & \\
organically with the &  &  &  &  & 5\\
rest of the governance &  &  &  &  & \\
structure? &  &  &  &  & \\
\hline
Does the policy take &  &  &  &  & \\
into account legal and &  &  &  &  & \\
regulatory as well as &  &  &  &  & \\
technological &  &  &  &  & 5\\
limitations and &  &  &  &  & \\
implications? &  &  &  &  & \\
\hline
 &  &  &  &  & \\
\end{longtable}
\end{frame}


\begin{frame}[allowframebreaks,label=]{Bibliography}
\printbibliography
\end{frame}
\end{document}
